#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.organization.aws_organizations_organization.this: Refreshing state... [id=o-hwwrcvd1kr]
module.organization.aws_organizations_organizational_unit.first_ou["crc"]: Refreshing state... [id=ou-ge83-hue015c5]
module.organization.aws_organizations_organizational_unit.second_ou["bootcamp-crc"]: Refreshing state... [id=ou-ge83-947oa2h8]
module.organization.aws_organizations_organizational_unit.second_ou["Development-crc"]: Refreshing state... [id=ou-ge83-do2aiscb]
module.organization.aws_organizations_organizational_unit.second_ou["Production-crc"]: Refreshing state... [id=ou-ge83-cakm2vds]
module.organization.aws_organizations_account.second_level["crc-Production-crc-prod"]: Refreshing state... [id=136273067277]
module.organization.aws_organizations_account.second_level["crc-Development-crc-dev"]: Refreshing state... [id=912008965710]
module.organization.aws_organizations_account.second_level["crc-bootcamp-bootcamp-account"]: Refreshing state... [id=621897290135]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.organization.aws_organizations_account.second_level["infrastructure-shared-infra-shared"] will be created
  + resource "aws_organizations_account" "second_level" {
      + arn               = (known after apply)
      + close_on_deletion = true
      + create_govcloud   = false
      + email             = "fabri1492+aws+shared@hotmail.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "infra-shared"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.organization.aws_organizations_organizational_unit.first_ou["infrastructure"] will be created
  + resource "aws_organizations_organizational_unit" "first_ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "infrastructure"
      + parent_id = "r-ge83"
      + tags_all  = (known after apply)
    }

  # module.organization.aws_organizations_organizational_unit.second_ou["shared-infrastructure"] will be created
  + resource "aws_organizations_organizational_unit" "second_ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "shared"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"

```

</details>

*Pusher: @fabrinator, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*